# Задача 26: Напишите программу, которая на вход принимает
# два числа A и B, и возводит число А в целую степень B с
# помощью рекурсии.

a,b = int(input('ввидите число:  ')),int(input('ввидите число: '))

# def expo(a,b):
#     for i in [1,2]:
#         return
#     return expo()    

print(a**b)