# Задача 20: В настольной игре Скрабл (Scrabble) каждая буква имеет определенную
# ценность. В случае с английским алфавитом очки распределяются так:
# ● A, E, I, O, U, L, N, S, T, R – 1 очко;
# ● D, G – 2 очка;
# ● B, C, M, P – 3 очка;
# ● F, H, V, W, Y – 4 очка;
# ● K – 5 очков;
# ● J, X – 8 очков;
# ● Q, Z – 10 очков.
# А русские буквы оцениваются так:
# ● А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# ● Д, К, Л, М, П, У – 2 очка;
# ● Б, Г, Ё, Ь, Я – 3 очка;
# ● Й, Ы – 4 очка;
# ● Ж, З, Х, Ц, Ч – 5 очков;
# ● Ш, Э, Ю – 8 очков;
# ● Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только
# английские, либо только русские буквы.

Slovo = str(input('Ввидите слово заглавными буквами:  '))
# FSlovo = Slovo.upper
# Slovo = Slovo.upper 
# print(Slovo) 
my_list = [
            ['A', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т','A', 'E', 'I', 'O', 'U', "L", "N", "S", "T", "R"],  # 1
            ['Д', 'К', 'Л', 'М', 'П', 'У','0','0','0','D', 'G','','','','','','','',''],  # 2
            ['Г', 'Ё', 'Ь', 'Я','0','0','0','0','0','B', 'C', 'M',' P','','','','','',''],  # 3
            ['Й', 'Ы','0','0','0','0','0','0','0','F', 'H', 'V', 'W', 'Y' ,'','','','','',''],  # 4
            ['Ж', 'З', 'Х', 'Ц', 'Ч','0','0','0','0','K','','','','','','','','',''],  # 5
            ['Ш', 'Э', 'Ю','0','0','0','0','0','0','J', 'X' ,'','','','','','',''],  # 8
            ['Ф', 'Щ', 'Ъ','0','0','0','0','0','0','Q', 'Z' ,'','','','','','','','']]  # 10
#print(my_list)


count = 0
for k in Slovo:
    # for i in range(7):
        for j in range(18):
            if my_list[0][j] == k:
                count += 1
                
            if my_list[1][j] == k:
                count += 2
                
            if my_list[2][j] == k:
                count += 3
                
            if my_list[3][j] == k:
                count += 4
                
                
            if my_list[4][j] == k:
                count += 5
                
            if my_list[5][j] == k:
                count += 8
                
            if my_list[6][j] == k:
                count += 10
                
print(count)


# dictionary1 = ["А"," В", "Е", "И", "Н", "О", "Р", "С", "Т"]
# dictionary2 = [Д, К, Л, М, П, У]
# dictionary3 = [Б, Г, Ё, Ь, Я]
# dictionary4 = [Й, Ы]
# dictionary5 = [Ж, З, Х, Ц, Ч]
# dictionary8 = [Ш, Э, Ю]
# dictionary10 = [Ф, Щ, Ъ]
# print(dictionary1)
# #printList(dictionary1)

# def printList (list):
#     for i in range(len(list)):
#         print(i)
